module.exports = `
问题 1
关于H3C SecPath U200-S产品的安全区域,以下说法正确的有:
A. 防火墙默认有五个安全区域:Management、Local 、Trust、untrust、DMZ
B. 防火墙自身所有接口都属于Local区域
C. 不同安全域的优先级一定不一样
D. Management和Local区域的默认优先级都是100
正确答案: ABD

 问题 2
查看SecPath防火墙会话的命令是()
A. display firewall session table
B. display firewall session
C. display session table
D. display aspf session
正确答案: C


 问题 3
SecPath IPS设备的管理口仅支持同网段管理端PC访问,当管理端PC的地址与设备管理地址不在同一网段时,无法对设备进行Web管理,以上说法是:
A. 正确
B. 错误
正确答案: B

问题 4
关于IPS攻击防御策略的下发,下列说法正确的有:
A. 策略可以基于不同的IP地址(段)下发
B. 策略可以基于时间下发
C. 策略可以根据用户的具体应用来制定相应的攻击防护策略下发
D. 策略下发启,必须应用到段上,并且激活才能生效
正确答案: ACD


 问题 5
以下哪个病毒可以破坏计算机硬件?
A. CIH病毒
B. 宏病毒
C. 冲击波病毒
D. 熊猫烧香病毒
正确答案: A


 问题 6
安全概念在所属的各个领域有着不同的含义,那么网络安全应属于
A. 经济安全领域
B. 信息安全领域
C. 生成安全领域
D. 国家安全领域
正确答案: B


 问题 7
信息安全的目标是实现:
A. 机密性
B. 完整性
C. 可用性
D. 可控性
E. 可审计性
正确答案: ABCDE


 问题 8
IIS( Internet Security Systems)公司提出的PDR安全模型包括哪三个方面?
A. 响应
B. 设计
C. 保护
D. 检测
正确答案: ACD


 问题 9
信息安全策略是特定应用环境中,为确保一定级别的安全保护所必须遵守的规则。而安全策略建立模型主要包括
A. 先进的技术
B. 相关法律法规
C. 管理审计制度
D. 先例与经验
正确答案: ABC


 问题 10
信息对抗主要的研究方向包括:
A. 黑客攻击防范
B. 入侵检测
C. 系统安全性分析与评估
D. 信息隐藏算法与匿名技术
正确答案: ABC


 问题 11
下列关于H3C SecPath ACG流控产品带宽管理技术描述中,正确的是（）
A. 接口:通常是指一个物理接口,与路由器或者交换机的网络接口相似
B. 通道带宽:通常将一个接口或者段的出方向带宽划分为个通道,每个通道都可以分配不同的平均带宽或者峰值带宽
C. 段：一个段可以理解为一条物理链路或者多条物理链路,是一个虚拟抽象的概念
D. 安全区域:多个物理接口的集合,是一个虚拟概念通常牙为,内部域”和"外部域

正确答案: ABCD


 问题 12
下列选项中,属于深度安全防卸技术的是(）
A. 状态监测
B. 应用识别
C. 内容识别
D. 威胁识别
正确答案: BCD


 问题 13
常见的内网用户行为监管应包括
A. 内网Web应用的审计
B. 内网网络共享应用的审计
C. 内网Q0MSN应用的审计
D. 内网FTP应用的审计
正确答案: ACD


 问题 14
H3C SecPath U200-S支持的行为审计协议包括()
A. FTP
B. HTTP
C. SMTP
D. Telnet
正确答案: ABC


 问题 15
下列网络应用程序中,可能会造成带宽大量占用的应用包括
A. 迅雷
B. PPlive 
C. Bit Torrent 
D. MSN
正确答案: ABC


 问题 16
常见的行为识别技术包括:
A. 基于端口的识别,主要应用子使用固定端口进行通信的引用,例如,HTTP、 FTP 
B. 基于行为特征的识别,主要是基于部分应用的数据流里和其它流量在行为特征上的差异来进行
C. IP地址的识别,至要是对某些使用固定IP地址的业务进行识别
D. 基于负载信息的识别,主要是基于部分协议在负载中含有,议特征字符串来完成识别
正确答案: ABD


问题 17
行为识别主要有三种方法,分别是
A. 基于负载信息的识别
B. 基于协议的识别
C. 基于端口的识别
D. 基于行为特征的识别
正确答案: ACD
 共三种，基于端口、基于行为特征、基于负载信息

问题 18
安全的含义包过
A. Security（安全）
B. Safety（可靠）
C. Security（安全）和safety（可靠）
D. risk（风险）
正确答案: C


 问题 19
在TCP连接的三次握手过程中,第一步是由发起端发送
A. SYN包
B. SCK包
C. UDP包
D. NULL包
正确答案: A


 问题 20
现在各种P2P应用软件层出不穷,P2P流量的识别也必须采用多种方法写作进行,以上说法是
A. 正确
B. 错误
正确答案: A


 问题 21
关于包过滤技术的描述,下列说法错误的是:单选
A. H3C UTM产品默认开启了包过滤功能
B. 用户并不知道报文是否被过滤,也就是说包过滤对用户端是透明的
C. 包过滤技术主要是根据报文中的IP头信息来进行过滤
D. 包过滤技术可以根据报文中的应用层信息进行过滤
正确答案: D


 问题 122
从管理和控制上来区分,主流的带宽管理技术包括:
A. 基于段的带宽管理技术
B. 基于用启IP地址的带宽管理技术
C. 基于应用协议的带宽管理技术
D. 基于MAC地址的带宽管理技术
正确答案: ABC


 问题 23
防火墙主要工作在网络的3-4层,其访问控制规则可以基于报文的五元组进行定义。下列元素中,哪些是五元组
的组成部分?
A. 源端口
B. 目的端口
C. 源地址
D. 协议
E. 目的地址
F. 载荷
正确答案: ABCDE


 问题 24
下面哪一个协议工作在TCP/IP协议栈的传输层以下?
A. SKIP
B. SSL
C. HTTPS
D. SSH
正确答案: A


 问题 25
黑名单表项可以手工添加,也可以有防火墙动态生成,上述说法是:
A. 正确
B. 错误
正确答案: A


 问题 26
常见的安全域划分方式有:
A. 按照接口划分
B. 按照业务划分
C. 按照规则划分
D. 按照IP地址划分
正确答案: A


 问题 27
在企业的内部信息平台中,存在的信息泄露的途径包括:
A. 可移动存储介质
B. 打印机
C. 内部网络共享
D. 公司对外的FTP服务器
正确答案: ABCD




问题 28
随着网络技术的不断发展,防火墙也在完成自己的更新换代,防火墙所经历的技术演进包括有:
A. 包过滤防火墙
B. 应用代理防
C. Dos防火墙
D. 状态检测防火墙
正确答案: ABD


 问题 29
下述哪些攻击手段是防火墙无法防御的?
A. Smurt
B. 跨站脚本攻击
C. 畸形报文攻击
D. 后门木马
E. WinNuke攻击
正确答案: BD



问题 30
永久黑名单表项建立后,会一直存在,直到超过一定生存时间后防火墙会自动将该黑名单表项删除,上述说法是
A. 正确
B. 错误
正确答案: B

问题 31
当防火墙接收到包含URL参数的HTTP请求报文时,根据Web传输参数方式,从报文中获取URL参数,目前防火墙支持的Web传输参数有:
A. PUT
B. GET 
C. PUSH
D. POST
正确答案: ABD


 问题 32
ARP协议报文包括有ARP请求和ARP应答报文
A. 错误
B. 正确
正确答案: B


 问题 33
SMTP协议使用的端口号是
A. 21
B. 25
C. 110
D. 22
正确答案: B


问题 34
使用防火墙Web过滤功能,可以组织或者允许内部用户访问某些特定网页
A. 正确
B. 错误
正确答案: A




问题 35
H3C UTM从高优先级域到低优先级域是允许访问的,但是反之不行,上述说法:
A. 正确
B. 错误
正确答案: B


问题 36
防火墙的策略一般是应用在安全域之间的,而IPS/AV策略一般应用在某个段上。
A. 正确
B. 错误
正确答案: A


 问题 37
下列攻击中,属于Dos拒绝服务玫击的是:
A. SYN Flood
B. ICMP Floed 
C. WinNuke攻击
D. UDPFlood 
正确答案: ABD

问题 38
根据由加密密钥得到解密密钥的算法复杂度差异,密码体制可以分为
A. 私钥密码体制
B. 公钥密码体制
C. 流密码
D. 分组密码
正确答案: AB



问题 39
防火墙能够防御的攻击包括:
A. 畸形报文攻击
B. DoS/DDOS
C. 扫描窥探攻击
D. 病毒木马
正确答案: ABCD

问题 40
以下关于DoS攻击的描述,正确的是?
A. 攻击者通过后门程序来入受攻击的系统
B. 攻击者以窃取目标系统上的机密信息为目的
C. 攻击行为会导致目标系统无法处理正常用户的请求
D. 如果目标系统没有漏洞,远程攻击就不可能成功
正确答案: C


 问题 41
H3C SecPath设备中, ACL主要应用于
A. Qos 中,对数据流里进行分类
B. IPSec中 用来规定触发建立IPSec的条件
C. NAT 中,限制哪些地址需要被转换
D. 域间访问,控制不同区域间的互访
E. 策略路由
正确答案: ABCE


 问题 42
SecPath防火墙中,下面哪些接口必须加入到区域中才能转发数据?
A. Loopback接口
B. 物理接口
C. Vitual-Template 接口 ( )
D. Encrypt 接口
E. Tunnel 接口
F. Dialer接口
G. Bridge Templatei接口
H. Vlan Interface接口
正确答案: BCEFGH     (Loopback接口不需要加入域就能通，实验已经确认）




问题 43
H3C SecPath防火墙中,配置IP地址资源的方式有哪些?
A. 主机地址
B. 范围地址
C. 子网地址
D. 网站域名
正确答案: ABCD


问题 44
H3C SecPath防火墙中,下面哪些攻击必须和动态黑名单组合使用?
A. WinNuke攻击
B. Land扫描攻击
C. 地址扫描攻击
D. Smurf攻击
E. 端口扫描攻击
正确答案: CE


 问题 45
关于SecPath防火墙,下列说法正确的是口
A. 防火墙只能通过命令行方式升级版本
B. 防火墙通过WEB登录的默认用户名/密码是h3c/h3c
C. 防水墙的默认登录IP地址是192.168.0.1
D. 防火墙的域间策略只能再Web页面下配
正确答案: C
 
问题 46
H3C SecPath防火墙Web网站过滤具有哪些功能?
A. 网站地址过滤
B. URL参数
C. JAVA阻断
D. ActiveX阻断
正确答案: ABCD

问题 47
IPS (入侵防御系统)是一种基（）的产品,它对攻击识别是基于（）匹配的
A. 应用层,特征库
B. 网络层,协议
C. 应用层,协议
D. 网络层,特征库
正确答案: A


 问题 48
下列关于对防火墙的功能描述,不正确的是
A. 防火墙能够执行安全策略
B. 防火墙能够产生审计日志
C. 防火墙能够限制组织安全状况的暴露
D. 防火墙能够防病毒
正确答案: D

问题 49
SecPath F1000-E防火墙Inline转发是依据Mac地址表完成的,上述说法是?
A. 正确
B. 错误
正确答案: B

问题 50
防火墙的DMZ区的主要用途是？
A. 解决公共设备如服务器防止问题
B. 解决军事侵犯问题
C. 解决防火墙区域划分不够问题
正确答案: A




问题 51
SecPath防火墙缺省开启黑名单功能。
A. 正确
B. 错误
正确答案: B

问题 52
一般来说,以下哪些功能不是由防火墙来实现的.
A. 隔离可信任网络和不可信网络
B. 防止病毒和木马程序入侵
C. 隔离内网和外网
D. 监控网络中会话状态
正确答案: B

问题 53
在防火墙应用中,一台需要与互联网通信的Web服务器放置在以下哪个区域时最安全?
A. DMZ区域
B. Trust区域
C. Local区域
D. Untrust 区域
正确答案: A

问题 54
由于新的漏洞、新的攻击工具、攻击方式的不断出现, IPS只有不断的更新特征库才能对网络、系统和业务的有效防御,下面关于IPS的特征：
A. H3C IPS升级持征库后需要重启设备才能是生效
B. H3C IPS特征库升级有手动升级和自动升级两种
C. H3C IPS只支持手动升级特征库
D. 用户可以H3C网站上自助进行License激活申请
正确答案: BD

问题 55
关于ACG1000智能和快速识别切换功能，下列说法正确的是：
A. 智能模式下应用识别只对50%流量生效,起到减轻设备性能压力的作用,在业务繁忙时可以使用
B. 快速模式下应用识别只对80%流里生效,起到减轻设备性能压力的作用,在业务繁忙时可以使用
C. 快速模式下应用识别只对50%流里生效,起到减轻设备性能压力的作用,在业务繁忙时可以使用
D. 系统默认智能模式
正确答案: CD



问题 56
ACG1000产品不支持VRF功能,因此无法可作为MCE设备和MPLS网络对接
A. 对
B. 错
正确答案: B

问题 57
ACG1000产品支持旁路部署,在系统管理-部署方式处将接收流量的接口打钩,并将流里镜像到该接口即可完成旁路部署
A. 对
B. 错
正确答案: A

问题 58
H3C NGFW的NAT特性支持下列哪些功能
A. NAT PAT
B. NAT-NOPAT
C. Easy-IP
D. NAT Server 
E. NAT444
F. NAT Static
G. NAT hairpin 
正确答案: ABCDEFG

问题 59
L2TP数据报文以报文的形式发送,注册的端口号为
A. UDP, 1700
B. TCР, 1700
C. TCP,1701
D. UDP,1701 
正确答案: D

问题 60
下列哪些协议属于二层隧道协议
A. L2TP
B. GRE
C. IPSec
D. PPTP
正确答案: AD

问题 61
IPSec协议族包含协议
A. PKI
B. AH 
C. ESP 
D. PPP
正确答案: BC

问题 62
IPSec协议支持哪些封装模式
A. 交换模式
B. 路由模式
C. 传输模式
D. 隧道模式
E. 桥模式
正确答案: CD

问题 63
防火墙不能实现哪些功能?
A. 不能实现web防篡改
正确答案: A


 问题 64
关于SSL VPN的三种接入方式,下列说法正确的是。
A. WEB方式实现的真正的“免客户端”,主要适合于访问WEB站点
B. TCP接入比较适谷使用固定IP地址和端口的TCP应用
C. IP接入可以支持任何基于IP协议的网络应用
D. Telnet服务器跃可以通过TCP接入又可以通过IP接入
正确答案: ABCD

问题 65
根据防火墙的技术的演进特性,可以分为
A. 电信级防火墙
B. SMB应用代理防火墙
C. 状态防火墙;
D. 包过滤防火墙
正确答案: BCD

问题 66
基本NAT方式是指直接使用接口的公网IP地址作为转换后的源地址进行地址转换。上述说法是( )-
A. 正确
B. 错误
正确答案: B


问题 67
防火墙具有隐藏私网内部网络结构,防止外部攻击源对内部服务器的攻击行为的技术,称之为
A. 地址过滤;
B. NAT
C. 反转
D. IP欺骗
正确答案: B

问题 68
NAT技术可以隐藏私网的网络结构 防止外部攻击源对内部服务器的攻击。上述说法是
A. 正确
B. 错误
正确答案: A

问题 69
在Internet上,常见的安全威胁包括
A. 拒绝服务攻击
B. 资源共享
C. ARP攻击泛滥
D. 未授收资源访问
正确答案: ACD


 问题 70
3C防火墙缺省的安全域包括
A. Trust
B. Untrust 
C. Local
D. DMZ
正确答案: ABCD

问题 71
ACL (访问控制列表)的类型包括哪些
A. 基本ACL
B. 高级ACL
C. 二层ACL
D. 基于时间段的包过滤
正确答案: ABC





问题 72
NAT的Easy IP方式可以实现公网地址的复用,有效解决1PV4地址短缺问题。
A. 正确
B. 错误
正确答案: B

问题 73
NAT的NAT PAT方式属于多对一的地址转换,通过使用”地址+端口号”的形式进行转换,使多个私网用户可共用一个公网IP地址访问外网。上述说法是
A. 正确
B. 错误
正确答案: A

问题 74
防火墙双机热备工作填式包括主备模式和负载分担模式
A. 正确
B. 错误
正确答案: A

问题 75
下列关于应用层网关(ALG)技术,说法正确的是
A. ALG是为了解决某些协议无法成功穿越NAT所产生的技术;
B. ALG可以对某些多通道协议的载荷信息进行解析;.
C. ALG可以解决包过滤防火墙无法理解数据报文上下文的问题
D. 除了解决NAT穿越问题, ALG还可以用来对应用层报文进行解析,从而阻断应用层攻击。
正确答案: ABC

问题 76
工程师小L在调试SecPath U200-S设备时,把缺省的GO/0接口当成内网口G0/1接口配置成了Untrust区域当成外网口,此时内网用户是否可以正常访问外网?
A. 能
B. 不能
正确答案: A   (SecPath U200-S设备 不是防火墙，所以不需要配置安全策略）


 问题 77
AAA ( Authentication 、Authorization 、Accounting ,认证、授权、计费)是网络安全的一种管理机制,提供了认证、授权、计费三种安全功能。
A. 正确
B. 错误
正确答案: A


 问题 78
用户AAA计费方式包括
A. 按流量计费
B. 本地计费
C. 远端计费
D. 不计费
正确答案: BCD


问题 79
哪些不属于AAA
A. ACL
B. Access
正确答案: AB

问题 80
AAA授权包括以下哪些？
A. 本地授权
B. 远程授权
C. 不授权
正确答案: A


 问题 81
NAT PAT功能涉及到哪些层？
A. 网络层和传输层
正确答案: A

问题 82
ACG以下错误的是?
A. 默认动作未不记录,还能往日志中查询到。
正确答案: A


问题 83
NGFW的特征库有哪些?
A. IPS
B. AV
C. ACG
D. ARP
正确答案: AB


 问题 84
防火墙实现包过滤的核心技术是ACL控制列表?
A. 正确
B. 错误
正确答案: A
 


问题 85
下列算法中，属于数字签名算法的是（）
A. SHA-1
B. DSA
C. RSA
D. MD5
正确答案: BC

 问题 86
下列说法中，属于对称密码体制的特点是（）
A. 必须保证密钥的绝对安全性
B. 密钥量级为参与者的数目
C. 适合大数据量的加解密，加解密速度快
D. 加解密密钥相同或可以互相推导
正确答案: ACD


 问题 87
SSL协议支持的加密算法包括
A. 3DES
B. DES
C. AES
D. RC4
正确答案: ABCD


问题 88
ESP报文格式如下图所示,关于ESP描述正确的有

A. SPI字段可以唯标识这个数据包的IPSec SA 
B. ESP协议报文用IP报文协议号51表示
C. 根据特定加密算法的要求,可以在Padding字段增加填充位
D. 验证字段(Authentication Data )对于ESP来说是必选字段
正确答案: A
AC

问题 89
如图所示, PC通过LAC建立到LNs的L2TP VPN连接,并通过该VPN隧道访问Http Sever服务器,发现能ping通该服务器,但是访问不了Http Server提供的Web页面,可能的原因为

A. LAC到LNS2间存在防火墙设备阻断了http访问
B. POEEAC之间存在防火墙设备阻断了http访问
C. LNSHp ever之间存在防火墙设备阻断了httpp访问
D. PC访问Http Sever交互报文长度为1500 ,且LAC和LNS之间有不支持IP分片的设备存在
正确答案: ABCD



问题 90
下面关于GRE说法正确的是
A. GRE用来封装IP协议报文时, GRE载荷协议类型号为0x0800,
B. GRE是一种在任意协议上承载任意-种其他协议的封装协议。
C. GRE报文对应IP协议号为50。
D. GRE协议不仅提供了隧道封装的方法,还提供了数据加密功能
正确答案: AB


 问题 91
下列算法中,既可以用于加密,也可以用于签名的是
A. AES
B. DES
C. RSA
D. DSA
正确答案: C


 问题 92
对证书授权中心的说法中,正确的是
A. CA按照证书链的层级机构进行工作
B. 证书授权中心简称CA
C. CA位于注册用户和RA之间
D. CA的最终权威中心成为根CA
正确答案: ABD


 问题 93
根据加密时对明文消息是否分组,密钥体制可以分为
A. 私钥密码体制
B. 序列密码
C. 公钥密码体制
D. 分组密码
正确答案: BD


问题 94
默认情况下LAC和LNS之间通道的Hello报文发送时间间隔为
A. 10
B. 5
C. 30
D. 60
正确答案: D


 问题 95
证书注册中心在收到用户的证书注册请求后,需要对注册用户进行验证,其验证的主要信息有
A. 确认注册用户有中请证书的权利
B. 确认注册用白拥有和证书请求相对应的私钥
C. 确认证书用户的身份信息正确
D. 确认注册用户是否曾注册过证书
正确答案: BC


 问题 96
在SSL协议体系中,服务器端使用()端口接收并处理建立SSL链接的请求报文
A. 443
B. 441
C. 500
D. 520
正确答案: A


 问题 97
关于x.509标准的说法,正确的是
A. 数字证书的格式不仅R有X509一种
B. 509是由国际电信联盟制定的数字证书标准
C. X609的版本号目前为V3 
D. x509标准除了被数字证书采用外,还广泛应用于IPsec、SSL、安全电子交易等网络应用
正确答案: ABCD

问题 98
标准GRE头中必选字段包括有
A. Protocol Type 
B. checksum
C. Key Field
D. Sequence Number
正确答案: A

 问题 99
密码体制是一个使得通信双方能能够进行秘密通信的协议,它是由
A. 密钥
B. 明文、密文
C. 加密算法、解密算法
D. 通信双方
E. 信道
正确答案: ABC

 问题 100
下面哪一项不是IKE的特点
A. 定时更新IPSec SA
B. 允许端到端动态验证
C. 定时更新IPsec共享密钥
D. 允许IPsec提供抗重播服务
正确答案: D
`;
